hmhalvorsen/fw-nrfconnect-nrf/samples/nrf9160/asset_tracker/src/main.c
/*
 * Copyright (c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-BSD-5-Clause-Nordic
 */

#include <zephyr.h>
#include <stdio.h>
#include <string.h>
#include <gps.h>
#include <sensor.h>
#include <console.h>
#include <nrf_cloud.h>
#include <dk_buttons_and_leds.h>
#include <misc/reboot.h>
#if defined(CONFIG_BSD_LIBRARY)
#include <bsd.h>
#include <lte_lc.h>
#include <lte_li.h>
#endif


#include "orientation_detector.h"

/* Interval in milliseconds between each time status LEDs are updated. */
#define LEDS_UPDATE_INTERVAL	        K_MSEC(500)

/* Interval in milliseconds between each time LEDs are updated when indicating
 * that an error has occurred.
 */
#define LEDS_ERROR_UPDATE_INTERVAL      K_MSEC(250)
#define LTE_STATUS_UPDATE_INTERVAL K_SECONDS(5)
#define CALIBRATION_PRESS_DURATION 	K_SECONDS(5)

#if defined(CONFIG_FLIP_POLL)
#define FLIP_POLL_INTERVAL		K_MSEC(CONFIG_FLIP_POLL_INTERVAL)
#else
#define FLIP_POLL_INTERVAL		0
#endif

#define BUTTON_1			BIT(0)
#define BUTTON_2			BIT(1)
#define SWITCH_1			BIT(2)
#define SWITCH_2			BIT(3)

#define LED_ON(x)			(x)
#define LED_BLINK(x)			((x) << 8)
#define LED_GET_ON(x)			((x) & 0xFF)
#define LED_GET_BLINK(x)		(((x) >> 8) & 0xFF)

#ifdef CONFIG_ACCEL_USE_SIM
#define FLIP_INPUT			BIT(CONFIG_FLIP_INPUT - 1)
#define CALIBRATION_INPUT		-1
#else
#define FLIP_INPUT			-1
#define CALIBRATION_INPUT		BIT(CONFIG_CALIBRATION_INPUT - 1)
#endif

#if defined(CONFIG_BSD_LIBRARY) && \
!defined(CONFIG_LTE_LINK_CONTROL)
#error "Missing CONFIG_LTE_LINK_CONTROL"
#endif

#if defined(CONFIG_BSD_LIBRARY) && \
defined(CONFIG_LTE_AUTO_INIT_AND_CONNECT) && \
defined(CONFIG_NRF_CLOUD_PROVISION_CERTIFICATES)
#error "PROVISION_CERTIFICATES \
	requires CONFIG_LTE_AUTO_INIT_AND_CONNECT to be disabled!"
#endif

enum {
#if defined(CONFIG_BOARD_NRF9160_PCA20035)
	LEDS_INITIALIZING	= LED_ON(0),
	LEDS_CONNECTING		= LED_BLINK(DK_LED3_MSK),
	LEDS_PATTERN_WAIT	= LED_BLINK(DK_LED2_MSK | DK_LED3_MSK),
	LEDS_PATTERN_ENTRY	= LED_ON(DK_LED2_MSK) | LED_BLINK(DK_LED3_MSK),
	LEDS_PATTERN_DONE	= LED_ON(DK_LED2_MSK | DK_LED3_MSK),
	LEDS_PAIRED		= LED_ON(DK_LED2_MSK),
	LEDS_CALIBRATING	= LED_ON(DK_LED1_MSK | DK_LED3_MSK),
	LEDS_ERROR_NRF_CLOUD	= LED_BLINK(DK_LED1_MSK),
	LEDS_ERROR_BSD_REC	= LED_BLINK(DK_LED1_MSK | DK_LED3_MSK),
	LEDS_ERROR_BSD_IRREC	= LED_BLINK(DK_ALL_LEDS_MSK),
	LEDS_ERROR_LTE_LC	= LED_BLINK(DK_LED1_MSK | DK_LED2_MSK),
	LEDS_ERROR_UNKNOWN	= LED_ON(DK_ALL_LEDS_MSK)
#else
	LEDS_INITIALIZING	= LED_ON(0),
	LEDS_CONNECTING		= LED_BLINK(DK_LED3_MSK),
	LEDS_PATTERN_WAIT	= LED_BLINK(DK_LED3_MSK | DK_LED4_MSK),
	LEDS_PATTERN_ENTRY	= LED_ON(DK_LED3_MSK) | LED_BLINK(DK_LED4_MSK),
	LEDS_PATTERN_DONE	= LED_BLINK(DK_LED4_MSK),
	LEDS_PAIRED		= LED_ON(DK_LED4_MSK),
	LEDS_CALIBRATING	= LED_ON(DK_LED1_MSK | DK_LED3_MSK),
	LEDS_ERROR_NRF_CLOUD	= LED_BLINK(DK_LED1_MSK | DK_LED4_MSK),
	LEDS_ERROR_BSD_REC	= LED_BLINK(DK_LED1_MSK | DK_LED3_MSK),
	LEDS_ERROR_BSD_IRREC	= LED_BLINK(DK_ALL_LEDS_MSK),
	LEDS_ERROR_LTE_LC	= LED_BLINK(DK_LED1_MSK | DK_LED2_MSK),
	LEDS_ERROR_UNKNOWN	= LED_ON(DK_ALL_LEDS_MSK)
#endif
} display_state;

struct env_sensor {
	enum nrf_cloud_sensor type;
	enum sensor_channel channel;
	u8_t *dev_name;
	struct device *dev;
};

struct lte_status {
	enum nrf_cloud_sensor type;
	enum lte_link_data_type data_type;
	enum lte_link_status status;
	enum lte_link_data_behavior behavior;
};

/* Array containing all nRF Cloud sensor types that are available to the
 * application.
 */
static const enum nrf_cloud_sensor available_sensors[] = {
	NRF_CLOUD_SENSOR_GPS,
	NRF_CLOUD_SENSOR_FLIP,
	NRF_CLOUD_SENSOR_TEMP,
	NRF_CLOUD_LTE_LINK_RSSI,
	NRF_CLOUD_LTE_LINK_BAND,
	NRF_CLOUD_LTE_LINK_OPERATOR,
	NRF_CLOUD_LTE_LINK_IP_ADDRESS,
};

static struct env_sensor temp_sensor = {
	.type = NRF_CLOUD_SENSOR_TEMP,
	.channel = SENSOR_CHAN_AMBIENT_TEMP,
	.dev_name = CONFIG_TEMP_DEV_NAME
};

/* Array containg environment sensors available on the board. */
static struct env_sensor *env_sensors[] = {
	&temp_sensor
};

static struct lte_status lte_status_rssi = {
	.type = NRF_CLOUD_LTE_LINK_RSSI,
	.data_type = LTE_LINK_DATA_TYPE_SHORT,
	.status = LTE_LINK_STATUS_RSSI,
	.behavior = LTE_LINK_BEHAVIOR_DYNAMIC,
};

static struct lte_status lte_status_band = {
	.type = NRF_CLOUD_LTE_LINK_BAND,
	.data_type = LTE_LINK_DATA_TYPE_SHORT,
	.status = LTE_LINK_STATUS_BAND,
	.behavior = LTE_LINK_BEHAVIOR_STATIC,
};

static struct lte_status lte_status_operator = {
	.type = NRF_CLOUD_LTE_LINK_OPERATOR,
	.data_type = LTE_LINK_DATA_TYPE_STRING,
	.status = LTE_LINK_STATUS_OPERATOR,
	.behavior = LTE_LINK_BEHAVIOR_STATIC,
};

static struct lte_status lte_status_ip_address = {
	.type = NRF_CLOUD_LTE_LINK_IP_ADDRESS,
	.data_type = LTE_LINK_DATA_TYPE_STRING,
	.status = LTE_LINK_STATUS_IP_ADDRESS,
	.behavior = LTE_LINK_BEHAVIOR_STATIC,
};

static struct lte_status *lte_status_data[] = {
	&lte_status_rssi,
	&lte_status_band,
	&lte_status_operator,
	&lte_status_ip_address,
};

 /* Variables to keep track of nRF cloud user association. */
static u8_t ua_pattern[10];
static int buttons_to_capture;
static int buttons_captured;
static bool pattern_recording;
static struct k_sem user_assoc_sem;

/* Sensor data */
static struct gps_data nmea_data;
static struct nrf_cloud_sensor_data flip_cloud_data;
static struct nrf_cloud_sensor_data gps_cloud_data;
static struct nrf_cloud_sensor_data env_cloud_data[ARRAY_SIZE(env_sensors)];
static struct nrf_cloud_sensor_data lte_cloud_data[ARRAY_SIZE(lte_status_data)];
static atomic_val_t send_data_enable;

/* Flag used for flip detection */
static bool flip_mode_enabled = true;

/* Structures for work */
static struct k_work connect_work;
static struct k_delayed_work leds_update_work;
static struct k_delayed_work flip_poll_work;
static struct k_delayed_work long_press_button_work;
static struct k_delayed_work link_status_work;

enum error_type {
	ERROR_NRF_CLOUD,
	ERROR_BSD_RECOVERABLE,
	ERROR_BSD_IRRECOVERABLE,
	ERROR_LTE_LC
};

/* Forward declaration of functions */
static void cloud_connect(struct k_work *work);
static void flip_send(struct k_work *work);
static void env_data_send(void);
static void sensors_init(void);
static void work_init(void);
static void sensor_data_send(struct nrf_cloud_sensor_data *data);
static void leds_update(struct k_work *work);

/**@brief nRF Cloud error handler. */
void error_handler(enum error_type err_type, int err_code)
{
	if (err_type == ERROR_NRF_CLOUD) {
		k_sched_lock();

#if defined(CONFIG_LTE_LINK_CONTROL)
		/* Turn off and shutdown modem */
		int err = lte_lc_power_off();
		__ASSERT(err == 0, "lte_lc_power_off failed: %d", err);
#endif
#if defined(CONFIG_BSD_LIBRARY)
		bsd_shutdown();
#endif
	}

#if !defined(CONFIG_DEBUG)
	sys_reboot(SYS_REBOOT_COLD);
#else
	switch (err_type) {
	case ERROR_NRF_CLOUD:
		/* Blinking all LEDs ON/OFF in pairs (1 and 4, 2 and 3)
		 * if there is an application error.
		 */
		display_state = LEDS_ERROR_NRF_CLOUD;
		printk("Error of type ERROR_NRF_CLOUD: %d\n", err_code);
	break;
	case ERROR_BSD_RECOVERABLE:
		/* Blinking all LEDs ON/OFF in pairs (1 and 3, 2 and 4)
		 * if there is a recoverable error.
		 */
		display_state = LEDS_ERROR_BSD_REC;
		printk("Error of type ERROR_BSD_RECOVERABLE: %d\n", err_code);
	break;
	case ERROR_BSD_IRRECOVERABLE:
		/* Blinking all LEDs ON/OFF if there is an
		 * irrecoverable error.
		 */
		display_state = LEDS_ERROR_BSD_IRREC;
		printk("Error of type ERROR_BSD_IRRECOVERABLE: %d\n", err_code);
	break;
	default:
		/* Blinking all LEDs ON/OFF in pairs (1 and 2, 3 and 4)
		 * undefined error.
		 */
		display_state = LEDS_ERROR_UNKNOWN;
		printk("Unknown error type: %d, code: %d\n",
			err_type, err_code);
	break;
	}

	while (true) {
		leds_update(NULL);
		k_busy_wait(LEDS_ERROR_UPDATE_INTERVAL * MSEC_PER_SEC);
		leds_update(NULL);
		k_busy_wait(LEDS_ERROR_UPDATE_INTERVAL * MSEC_PER_SEC);
	}
#endif /* CONFIG_DEBUG */
}

